In [1]:
st = [1,2,2,2,2,2,2,2,2,3,3]
ts=set(st)
st=list(ts)
print (st)
type (st)

[1, 2, 3]

list

In [2]:
for x in st:
    print(x)

1
2
3

In [3]:
a=[1,2,3]
b=[4,[5.1,5.2,['5.2.1','5.2.2']],6]

In [4]:
def prompt():
    answer = input("Enter Y to continue and N to exit\n")
    if answer=="Y":
        Marks()
    elif answer=="N":
        print ("Thank you")
    else:
        print("Enter either Y or N")
        prompt()
        
def Marks():
    MarksObtained= input("Enter Marks Obtained:")
    MarksObtained = float(MarksObtained)
    if MarksObtained>=50 and MarksObtained<75:
        print ("Third Division")
        prompt()
    elif MarksObtained>=75 and MarksObtained<90:
        print ("Second Division")
        prompt()
    elif MarksObtained>=90 and MarksObtained<=100:
        print ("First Division")
        prompt()
    elif MarksObtained<50:
        print ("FAIL")
        prompt()
    else:
        print("Enter marks in range 0-100")
        Marks()

        
        
Marks()

Enter Marks Obtained:29
FAIL
Enter Y to continue and N to exit
N
Thank you

In [5]:
j=1
for i in range(1,4):
    print((4-i)*" "+j*"*")
    j+=2

   *
  ***
 *****

In [6]:
8.99999999999999//2

4.0

In [7]:
k="hell"
print(k.center(10,'o'))

ooohellooo

In [8]:
x=int(input())
print(x)

12
12

In [9]:
list1= ['A','B','C','A','D','E','F','G','H','E','D']
list2=[]
for elem in list1:
    if elem not in list2:
        list2.append(elem)
    else:
        print('hello')
        print(list2)

hello
['A', 'B', 'C']
hello
['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']
hello
['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']

In [10]:
list2= []
[list2.append(x) for x in list1 if x not in list2]
list2

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']

In [11]:

def occurrence(lst, n):
    count=0
    for i in lst:
        if i==n:
            count+=1
    return count

occurrence([1,2,2,2,2,2,2,2,2,2,2,2,2,2,2],2)

14

In [12]:
def factorial(n):
    sum=1
    while n>=2:
        sum=sum*(n)
        n=n-1
    print (sum)

factorial(25)

15511210043330985984000000

In [13]:
num='2893789273987'
revnum= ''
#for i in num:
#   print(num[int(i)])
for i in range(0, len(num)):
    revnum=str(num[i])+revnum
    i+=1
    

revnum=int(revnum)
print(revnum, i)

7893729873982 13

In [14]:
num=4398284979827
str(num)[::-1]

'7289794828934'

#### Pankaj - Assignment

In [131]:

list1=[1,2,3,4,5,6,7,8,9,10,11]
for elem in list1:
    print(elem)

1
2
3
4
5
6
7
8
9
10
11

In [16]:
for elem in list1:
    if elem>5:
        print(elem)

6
7
8
9
10
11

In [34]:
for i in range(0,len(list1),2):
    print(list1[i])

1
3
5
7
9
11

In [35]:
x=80
for i in range (len(list1)-3, len(list1)):
    list1[i]=x
    x=x+10
    
list1

[1, 2, 3, 4, 5, 6, 7, 8, 80, 90, 100]

In [48]:
list2=[11,20]
list1.extend(list2)
print(list1)
join1=list1+list2
print(join1)

[11, 20]
[11, 20, 11, 20]

In [49]:
for elem in list1:
    list1.remove(elem)
list1

[20]

In [50]:
for i in range(len(list1)):
    list1.pop(i)
list1

[]

In [71]:

tup1=(1,2,3,4,5,6,7,8,9,10,11)
for elem in tup1:
    print(elem)
for elem in tup1:
    if elem>5:
        print(elem)

1
2
3
4
5
6
7
8
9
10
11
6
7
8
9
10
11

In [67]:
for i in range(0,len(tup1),2):
    print(tup1[i])

1
3
5
7
9
11

In [72]:
tup2=(11,20)
join2=tup1+tup2
print(join2)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 11, 20)

In [73]:
tup1
del(tup1)

In [76]:
dict1={'Name':['Shubh','Preeti','Yanny','Priya','Harpreet'],
      'Manager':['Harry','Harry','Harry','Harry','Harry'],
       'Team':['Python','Python','Python','Python','Python']
      }
dict1

{'Name': ['Shubh', 'Preeti', 'Yanny', 'Priya', 'Harpreet'],
 'Manager': ['Harry', 'Harry', 'Harry', 'Harry', 'Harry'],
 'Team': ['Python', 'Python', 'Python', 'Python', 'Python']}

In [82]:
for key in dict1:
    print(key)

Name
Manager
Team

In [88]:
for value in dict1.values():
    for i in range(len(value)):
        print(value[i])

Shubh
Preeti
Yanny
Priya
Harpreet
Harry
Harry
Harry
Harry
Harry
Python
Python
Python
Python
Python

In [89]:
dict1

{'Name': ['Shubh', 'Preeti', 'Yanny', 'Priya', 'Harpreet'],
 'Manager': ['Harry', 'Harry', 'Harry', 'Harry', 'Harry'],
 'Team': ['Python', 'Python', 'Python', 'Python', 'Python']}

In [90]:
dict1.update({'Salary':[12100021,12213,88778,987896,689090]})

In [91]:
dict1

{'Name': ['Shubh', 'Preeti', 'Yanny', 'Priya', 'Harpreet'],
 'Manager': ['Harry', 'Harry', 'Harry', 'Harry', 'Harry'],
 'Team': ['Python', 'Python', 'Python', 'Python', 'Python'],
 'Salary': [12100021, 12213, 88778, 987896, 689090]}

In [92]:
dict1['Name'][2]= 'Pankaj'

In [93]:
dict1

{'Name': ['Shubh', 'Preeti', 'Pankaj', 'Priya', 'Harpreet'],
 'Manager': ['Harry', 'Harry', 'Harry', 'Harry', 'Harry'],
 'Team': ['Python', 'Python', 'Python', 'Python', 'Python'],
 'Salary': [12100021, 12213, 88778, 987896, 689090]}

In [129]:
def sumul(x,y):
    if x>10 or y>10:
        return x+y
    else:
        return x*y


try:
    x=int(input())
    y=int(input())
except:
    print('Enter number only')
else:
    print(sumul(x,y))
### def checknum(x,y):
#   if type(x) and type(y) == int:
#       print (sumul(x,y))
#   else:
#       print('Enter number only')

2176
gsyug
Enter number only

In [128]:
import pandas as pd
df=pd.DataFrame.from_dict(dict1)
df

       Name Manager    Team    Salary
0     Shubh   Harry  Python  12100021
1    Preeti   Harry  Python     12213
2    Pankaj   Harry  Python     88778
3     Priya   Harry  Python    987896
4  Harpreet   Harry  Python    689090

In [99]:
df.head(2)

     Name Manager    Team    Salary
0   Shubh   Harry  Python  12100021
1  Preeti   Harry  Python     12213

In [100]:
df.tail(3)

       Name Manager    Team  Salary
2    Pankaj   Harry  Python   88778
3     Priya   Harry  Python  987896
4  Harpreet   Harry  Python  689090

In [103]:
df.shape

(5, 4)

In [104]:
df.loc[3][1]

'Harry'

In [110]:
df.loc[(df.Salary>88778),['Name','Salary']]

       Name    Salary
0     Shubh  12100021
3     Priya    987896
4  Harpreet    689090

In [111]:
df.iloc[1:3,2:3]

     Team
1  Python
2  Python

In [112]:
df.iloc[]

987896